{"store_data": {"ryanscustomjewelry": "Ryan's Custom Jewelry is locally owend and operated.  Our staff is trained in all types of jewelry, watch, and clock repair. We support for all your custom jewelry needs.", "joyeria": "Joyeria is your destination for gold jewelry and accessories. If you're looking for the perfect gift, or want to sell your gold jewelry, then come visit our storefront today!", "journeys": "Journeys carries the hottest brands and latest styles of men's shoes, women's shoes, clothing and more.  Come find the athletic, skate, or casual shoes that you want!", "petco": "PetCo offers pet supplies, pet products, and pet food for all your animal needs.  Our commitment to Natural, Holistic, and Organic pet food is unparalleled in the industry.", "lhmmegaplex": "Larry H Miller Megaplex Theatre features the hottet new movies in state-of-the-art theatres, including IMAX 3D screens, for the best viewing experience possible.", "radioshack": "Visit RadioShack today for a great selection of the latest tablets, no-contract phones, audio accessories, Bluetooth devices, DIY components, and so much more!", "childrensplace": "Find fashionable kids clothing at The Children's Place that your children will love, including boys' apparel, girls' apparel, toddler apparel, and baby apparel.", "trinketstreasures": "Trinkets & Treasures offers a huge selection of clothing, accesories, shoes, and so much more!  Stop by today and find the ideal present for yourself or anyone on your list!", "passionnails": "Passion Nails is a specialty beauty salon which offers premium nail care services such as manicures, pedicures, and nail enhancements--all for affordable prices!", "wingers": "Winger's is dedicated to keeping your taste buds tingling.  From our kitchen to the plate on your table, happiness is the reason you'll be coming back for more.", "ross": "Ross Dress for Less offers the widest selection of in-season, name-brand apparel, accessories and footwear for the entire family, all for the lowest prices you can find.", "rue21": "\\u201crue\\u201d comes from the French word for \\u201cstreet\\u201d while \\u201c21\\u201d embodies the age that everyone wants to be! Our store offers fashion that\\u2019s modern, trendy, and affordable.", "mrscav": "Mrs. Cavanaugh's invites you to taste our delicious chocolates made from scratch with fresh cream & butter - No Preservatives.  All of our Chocolate is made with love.", "xzone": "X-Zone has all the best clothing, shoes, accessories, and more for women and girls.  Come to the store today and find something fun and sporty to brighten up your day!", "morganjewelers": "Morgan Jewelers has an amazing selection of diamond jewelry, including engagement rings, bridal sets, necklaces, earrings and bracelets.  Visit us today.", "sushimonster": "Sushi Monster is proud to serve Japaneese hibachi entrees, bento box lunch specials, and delicious sushi rolls.  Come find out why all our customers leave happy!", "tmobile": "Discover T-Mobile's best cell phones and plans with no annual contract including the iPhone and Android cell phones.  Find affordable cell phones and flexible plans today!", "nikkisbridal": "Nikki's Bridal carries a wide variety of brand name wedding dresses and prom dresses for women and girls.  We can help you find the right dress for any occasion.", "purseplus": "Purse Plus is the best place to find the accessories you need to make every outfit the best look possible.  Explore our large seleciton of pursues and so much more!", "jimmyjohns": "Jimmy John's, we've got something people crave and it's dang good.  Come taste our Gourmet Sandwiches \\u2013 Freaky Fast Delivery & World Class Catering!", "silverloft": "Silver Loft offers stylish jewelry and accessories for any occasion. If you're looking for the perfect gift for loved ones, or a treat for yourself, then shop at Silver Loft!", "olivegarden": "Welcome to Olive Garden Italian Restaurants.  Stop by today and explore the new Olive Garden to enjoy family style dining and fresh Italian food at our local restaurants!", "popcorncottage": "Popcorn Cottage is your source for great popcorn.  Check out the wide variety of flavors we have available, made fresh every day and available in decorative tins for gifts!", "fadsnfashions": "Fads N\\' Fashions Boutique is Utah\\'s Most Unique Boutique, bringing the new and \"what\\'s next\" to our customers.  Shop with us to enjoy helpful and personal attention.", "xbrands": "XBrands Custom Tees & Stickers gives you the opportunity to customize shirts, hoodies, tank tops, stickers, and much more, with awesome designs of your choosing!", "accesoryshop": "The Accesory Shop has all the belts, bracelets, earings, gloves, necklaces, scarves, and sunglasses that you need.  Accesorize for work, social life, or anything in between!", "schubachjewelers": "Schubach Jewelers is our destination for wedding rings, anniversary gifts, and birthday presents, including bracelets, necklaces, earings, lockets, and so much more!", "sprint": "Sprint Wireless provides a wide array of digital and analog wireless communication services, including the latest mobile telephone and two-way radio dispatch.", "movies9": "Cinemark Valley Fair Movies 9 features some of the most recent movies in quality theatres, offering a discount opportunity to enjoy a movie theatre experience.", "nerdstore": "The Nerd Store has a great selection of comic books, fan apparel, and all things related to your inner-nerd.  Come visit our friendly staff to find the ideal gift.", "tropicaljuice": "Tropical Juice serves delicious fruit juice beverages made from the freshest ingredients.  Come try one of our wonderful drinks and make today the best day possible!", "claires": "Claire's is the leader in accessories and jewelry for girls and young women.  The Katy Perry Prism Collection exclusively by Claire's has arrived, come shop now!C", "ricevillage": "Rice Village serves a wide range of delicious Asian food, with options that will please the entire family.  We are proud to give every customer a tasty meal.", "gamepeddler": "The Game Peddler has all the latest Xbox One, PS4, Wii U, PC, Xbox 360, PS3, and 3DS games available for purchase. You can also trade in your old games.", "deseretbook": "Deseret Book offers the largest collection of LDS products available, including a searchable inventory database and a wide range of LDS information.", "browspa24": "Brow Spa 24 offers eyebrow threadings, eyelash Extension, facials, henna tattoos, and waxing.  Our number one priority is the complete satisfaction of every customer.", "boost": "Boost Mobile heard that you want better phones, less comittment, and great service.  Ask and you shall receive.  Come check out your prepaid and no-contract smart phones.", "subway": "Subway is the undisputed leader in providing choices to design exactly what you want to eat, including many healthier options, always made with fresh ingredients.", "uniquegifts": "Unique Gifts specializes in providing you with fun items that you cannot find anywhere else.  Visit our store today to find new and exciting things you never before imagined!", "jbvariety": "JB Variety has the perfect gift for anyone, with a wide range of clothing, accesories, shoes, and so much more!  Stop by today and get lost our giant selection.", "greekkabob": "Greek Kabob serves delicous meditarraneous cuisine including such classic Greek-American dishes as gyro combination platters and traditional greek salads.", "famousfootwear": "Famous Footwear offers a wide selection of brand name shoes for women, men, and kids.  Victory is Yours. It's more than a statement, it's a promise.", "osakajapan": "Osaka Japan serves all your favorite oriental dishes including rice bowls and entrees.  Visit our restaurant in the food court and try our delicious food today!", "charleysalon": "Charley Salon is a full service beauty salon offering the newest hairstyles and haircuts for women, men, and children.  Our stylists can help you look your very best!", "urbanexpress": "Urban Express offers a great selection of mens', womens', boy', and girls' clothing.  We have something to make everyone in the family happier with their wardrobe!", "footaction": "Footaction USA sells athletic shoes and apparel for men, women, and children.  Come find marquee footwear and branded apparel for a street-inspired style.", "pretzelmaker": "Pretzel Maker is home of the World's Best Soft Pretzel.  We offer an awesome selection of hot, fresh-baked, fresh twisted pretzels, pretzel dogs, and cold beverages.", "centurylink": "CenturyLink offers your famil and business a reliable local provider of high speed internet, phone and TV services to homes as well as large and small businesses.", "chinesegourmetexpress": "Chinese Gourmet Express serves everyone's favorite Chinese combination platters, including our most popular dish: Orange Chicken.  Come try our food today!", "redrobin": "Red Robin is proud to serve you our countless mouthwatering selections \\u2014 from Fire-Grilled Burgers to Wraps to Entrees and Salads and so much more. Yummm.", "att": "Find exclusive online offers from AT&T, the nation's most reliable 4G LTE network. Get the latest phones like the Galaxy S4, the iPhone 5s, and many others.", "kayjewelers": "Kay Jewelers invites you to shop our selection of engagement rings, wedding rings, diamonds, gemstones, metals, watches and more.  Every kiss begins with Kay.", "tieoneon": "Tie on On is the premier provider of ties in the market.  Large varieties of Mens' Ties, Bow Ties, Holiday Ties, Novelty Ties, Boys' Ties ,and a full inventory of Wedding ties.", "kidsfashion": "Kid's Fashion provides awesome brands and fantastic styels in boys', girls', and baby clothing.  Visit our store to find the best fashion available for every child in your life!", "footlocker": "Foot Locker offers Basketball Shoes, Casual Shoes, Sneakers, Running Shoes - New Releases & Exclusive Styles from Jordan, Nike, adidas, Under Armour & more.", "bbb": "Bed Bath & Beyond offers a wide selection of products for the bedroom and bathroom, as well as kitchen and dining room.  Come check out our newest items!", "modabella": "Moda Bella gives you compelling apparel complemented by exceptional customer care.  We offer a broad selection of merchandise from national and exclusive brand stores.", "rave": "Rave is your destination for womens', girls', mens', and boys' apparel.  We carry the latest styles and most popular brand names, so come find exactly what you want!", "smashburger": "Smashburger is a fast-casual restaurant designed to be offer great-tasting cooked to order burgers, french fries, and milkshakes.  Smashed fresh.  Served delicious.", "payless": "Payless ShoeSource is your destination for the hottest new styles in women's, kids', or men's shoes, boots, sandals, designer brands, accessories, and more.", "fragranza": "Fragranza offers a wide range of cologne and perfume at prices that you can afford.  You never get a second chance at a first impression, so come find your fragrance!", "2love": "2 Love offers a wide selection of clothing for the entire family. Regardless of the season or occasion, Shoes 2 Love has exactly the right fashion for your needs.", "2loveshoes": "Shoes 2 Love offers a wide selection of shoes for the entire family. Regardless of the season or occasion, Shoes 2 Love has exactly the right shoes for your needs.", "cricket": "Cricket Wireless offers prepaid cell phones and no contract cell phone plans.  Other cell phone companies don't compare! Flexible, affordable, reliable.", "sweet16": "Sweet 16 helps everyone find youthful fashions in womens' and girls' clothing, accessories, and so much more.  Visit our style to give your wardrobe a makeover!", "asianapps": "Asian Apps + serves delicious snacks and appetizers from various Asian cultures.  Visit our store to find the perfect treat to make today the best day ever.", "bathbodyworks": "Bath & Body Works specializes in shower gels, lotions, fragrance mists, perfumes, and candles.  We are committed to creating America's favorite fragrances.", "shoeoutlet": "Shoe Outlet carries a wide selection of brand name shoes, boots, sandals, and flip flops, for women, men, and children.  Come find the pair that you've been waiting for!", "edible": "Edible Arrangements offers fresh fruit and gourmet chocolate dipped fruit made-to-order, melding the concept of fruit baskets with beautiful floral designs.", "rumbi": "Rumbi Island Grill is proud to serve mouth-watering rice bowls, entree salads, burgers, sandwiches, and island sweet.  Island Fresh & Flavorful!", "dcwesternwear": "DC Western Wear is your destination for authentic Western apparel, including cowboy hats, cowboy boots, and so much more.  Come find your inner cowboy or cowgirl!", "gnc": "Shop GNC for vitamins, supplements, minerals, herbs, sports nutrition, diet and energy, and health and beauty products.  Men and women can find exactly what they need.", "2020": "20/20 is a boutique store offering the freshest trends and most exciting womens' and girls' fashion to Valley Fair Mall.  Visit our store to find your new favorite outfit!", "sweettoothfairy": "There's a fairy known around town as the Sweet Tooth Fairy.  She creates enchanting sweets-using ingredients-that captivate each lucky person who gets a taste!", "fanzz": "At Fanzz you can find NFL, MLB, NBA, NCAA, NHL jerseys for men, women, and youth.  Come get your Utah Jazz, Real Salt Lake, Utah Utes, and BYU Cougars gear.", "frogurt": "Frogurt Frozen Yogurt is a unique self serve frozen yogurt caf\\xe9 concept that specializes in the highest quality products offered in a fun and comfortable dining atmosphere.", "lacuts": "L.A. Cuts is a full service beauty salon offering the latest hairstyles and haircuts for men, women, and children.  Visit one of our stylists to find the perfect look for you!", "mdphotography": "MD Photography offers professional photography services for all your needs, including wedding pictures, family portraits, graduation photographs, and many more!", "macys": "Macy's has the latest fashion brands for Women's, Men's, and Children's Clothing, Accessories, Jewelry, Beauty, Shoes, in addition to Bed/Bath products for your home.", "cellagain": "Buy the newest, hottest phone from Cell Again without a contract.  Sell your old phone for cash, or pick up a previously-owned phone at an incredible price.", "zumiez": "Zumiez is your destination for cutting edge clothing, shoes, accessories, and gear for skateboarding, snowboarding, and surf lifestyles for guys, girls, and kids.", "westvalleymusic": "West Valley Music carries a wide range of musical instruments and equipment including drums, guitars, bass, keyboards, amplifiers, recording equipment, and headphones.", "jambajuice": "Jamba Juice offers healthy breakfast, quick lunch or a delicious snack.  Try our fruit smoothies, all-natural baked goods, steel-cut oatmeal, sandwiches and other healthy food!", "jolene": "Jolene Girls' Dresses carries the largest selection of special occasion wear and flower girl dresses in the Utah.  Come visit our store to find the perfet dress for any event!", "shoemania": "Shoe Mania is your destination for mens', womens', and kids' shoes, boots, flip flops, and sandals.  We have the shoes that you need for every season and occasion!", "tgifridays": "TGI Fridays offers great food and amazing drinks.  From burgers to steak and beer to mixed drinks, you don't have to wait till Friday to have fun this week!", "bazzar": "The Bazzar has the perfect gift for anyone, with a wide range of clothing, accesories, shoes, and so much more!  Stop by today and get lost our giant selection.", "hotdogstick": "Hot Dog on a Stick serves the finest products, including our original lemonade and hot dogs on a stick, plus french fries, funnel cake sticks, and even beef hot dogs!", "gamegridarcade": "Video games are our passion and in addition to providing a safe facility where to play, we strive toprovide the most unique gaming experience you can find.", "orangejulius": "Orange Julius offers delicous juice drinks and premium fruit smoothies, made fresh to order.  Come try the frothy and tasty drink that started it all: the Julius Original.", "caferio": "Cafe Rio has no feezers or microwaves, we always make our food with fresh ingredients.  Come try our famous burritos, salads, tacos, enchiladas, quesadillas, and nachos!", "hammond": "Hammond Toy and Hobby sells toys kids actually play with.  We offer a wide selection of the newest toys, as well as the classics you remembered as a child.", "ikustomz": "iKUSTOMZ has the coolest cases and accessories for your Apple iPhone, Samsung Galaxy, and many others!  We also have cases and accessoreis for your tablet.", "diamondwireless": "As one of Verizon Wireless' largest Premium Retail partners in the United States, Diamond Wireless focuses on aggressive pricing and excellent customer service.", "jcpenney": "JCPenney offers a wide selection of your favorite women's clothing, men's clothing, boy's and girl's clothing, home furniture, bedding, jewelry and shoes.", "ulta": "ULTA Beauty offers customers prestige & mass cosmetics, makeup, fragrance, skincare, bath & body, haircare tools & salon.  Enjoy the finest products available!", "churrosolepizzeria": "Churro's Ole' Pizzeria is your destination for delicious pizza that the entire family can enjoy.  Visit the food court to get the food that you are craving!", "cafezupas": "Caf\\xe9 Zupas specializes in gourmet soups, salads, and sandwiches and uses only fresh ingredients with an exotic flair.  Dine in, take out, and catering!", "maurices": "Maurice's offers a wide selection of women's clothing in sizes 1-26, including jeans, tops, and dresses. Inspired by the girl in everyone, with options for every size.", "zagg": "Zagg is your best fit for the mobile devices and gadgets that you absolutely love.  From the toughest protection to performance-enhancing accessories, ZAGG fits your life."}}
